## Data Exploration

importing necessary libraries

In [3]:
import pandas as pd
import numpy as np
import os

importing data

In [9]:
raw_path = os.path.join(os.path.pardir,'data','raw')
train_file = os.path.join(raw_path,'train.csv')
test_file = os.path.join(raw_path,'test.csv')

In [10]:
train_df = pd.read_csv(train_file,index_col = 'PassengerId')
test_df = pd.read_csv(test_file,index_col = 'PassengerId')

high-level analysis

In [12]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [13]:
test_df['Survived']=-4

In [15]:
full_df = pd.concat((test_df,train_df),axis=0)

In [16]:
full_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 892 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    1309 non-null   int64
 1   Name      1309 non-null   object
 2   Sex       1309 non-null   object
 3   Age       1046 non-null   float64
 4   SibSp     1309 non-null   int64
 5   Parch     1309 non-null   int64
 6   Ticket    1309 non-null   object
 7   Fare      1308 non-null   float64
 8   Cabin     295 non-null    object
 9   Embarked  1307 non-null   object
 10  Survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 122.7+ KB

In [17]:
full_df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,-4
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,-4
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,-4
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,-4
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,-4

In [18]:
full_df.tail()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
PassengerId,,,,,,,,,,,
887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S,0
888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,1
889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,0
890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,1
891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,0

In [22]:
m_passengers = full_df.loc[full_df.Sex == 'male',:]
f_passengers = full_df.loc[full_df.Sex == 'female',:]
m_passengers_f_class = full_df.loc[((full_df.Sex == 'male') & (full_df.Pclass ==1)),:]
f_passengers_f_class = full_df.loc[((full_df.Sex == 'male') & (full_df.Pclass ==1)),:]

In [29]:
print('Male passengers:' + str(len(m_passengers)))
print('Female passengers:' + str(len(f_passengers)))
print('Male first class passengers:' + str(len(m_passengers_f_class)))
print('Female first class passengers:' + str(len(f_passengers_f_class)))

Male passengers:843
Female passengers:466
Male first class passengers:179
Female first class passengers:179